---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.DetailLevel
source: html/e7042469-8b4d-6e4a-179d-bb0631c4019e.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.DetailLevel Property

The detail level.

## Syntax (C#)
```csharp
public ViewDetailLevel DetailLevel { get; }
```